import React from 'react'
import { Text } from '@chakra-ui/react'
export const escRules = [
  {
    contents: [
      'เพื่อให้การเลือกตั้งหัวหน้านิสิต กรรมการนิสิตคณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย ประจำปีการศึกษา 2564 เป็นไปได้ด้วยความเรียบร้อย',
      'คณะกรรมการดําเนินการเลือกตั้งกรรมการนิสิตคณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย ประจำปีการศึกษา 2564 จึงมีประกาศให้กําหนดระเบียบการเลือกตั้งหัวหน้านิสิต กรรมการนิสิตคณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย ประจำปีการศึกษา 2564 ไว้ดังต่อไปนี้',
    ],
  },
  {
    header:
      'ข้อ 1 การเลือกตั้งหัวหน้านิสิต กรรมการนิสิตคณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย ประจำปีการศึกษา 2564',
    contents: [
      'การเลือกตั้งหัวหน้านิสิต กรรมการนิสิตคณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัยประจำปีการศึกษา 2564 มาจากการเลือกตั้งโดยนิสิตชั้นปีที่ 1 2 และ 3 คณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย ปีการศึกษา 2563 และในประกาศฉบับนี้จะใช้คำเรียกว่า “การเลือกตั้ง”',
    ],
  },
  {
    header: 'ข้อ 2 กำหนดวัน เวลา และสถานที่ในการเลือกตั้ง',
    contents: [
      'ให้กระทำการเลือกตั้งในวันพุธที่ 7 เมษายน พ.ศ. 2564 ตั้งแต่เวลา 08.30 น. ถึงเวลา 17.30 น. โดยให้นิสิตผู้มีสิทธิออกเสียงเลือกตั้งลงคะแนนผ่านระบบออนไลน์ของ กวศ.',
    ],
  },
  {
    header: 'ข้อ 3 สถานที่นับคะแนน และรวมคะแนน',
    contents: [
      'การรวบรวมผลคะแนนจะทำในระบบออนไลน์ของ กวศ. หลังหมดเวลาการเลือกตั้ง คือ ตั้งแต่เวลา 17.30 น. ของวันพุธที่ 7 เมษายน พ.ศ. 2564 เป็นต้นไป',
    ],
  },
  {
    header: 'ข้อ 4 ตำแหน่งที่กำหนดไว้สำหรับการเลือกตั้งตามข้อ 1',
    contents: [
      'การเลือกตั้งนี้เป็นการเลือกตั้งตำแหน่งหัวหน้านิสิต กรรมการนิสิตคณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย ปีการศึกษา 2564',
    ],
  },
  {
    header: 'ข้อ 5 คุณสมบัติของผู้สมัครรับเลือกตั้ง',
    contents: [
      '5.1 ต้องไม่เป็นนิสิตสภาพวิทยาทัณฑ์ กล่าวคือ ต้องมีเกรดเฉลี่ยสะสมไม่ต่ำกว่า 2.00',
      '5.2 ต้องไม่เป็นนิสิตที่เคยถูกลงโทษตัดคะแนนความประพฤติ',
      '5.3 ผู้สมัครรับเลือกตั้งในตำแหน่งดังข้อ 4 ต้องเป็นนิสิตที่กำลังจะศึกษาในระดับชั้นปริญญาบัณฑิต ชั้นปีที่ 3 หรือ 4 คณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย ในปีการศึกษา 2564 (รหัสประจำตัวนิสิต 613xxxxx21 หรือ 623xxxxx21)',
      '5.4 ต้องไม่เป็นผู้สมัครรับเลือกตั้งดังต่อไปนี้',
      <Text key="5.4.1" style={{ textIndent: '4rem' }}>
        5.4.1 ผู้ดำรงตำแหน่ง 10
        ตำแหน่งในคณะกรรมการบริหารองค์การบริหารสโมสรนิสิตจุฬาลงกรณ์มหาวิทยาลัย
        (อบจ.) ปีการศึกษา 2564
      </Text>,
      <Text key="5.4.2" style={{ textIndent: '4rem' }}>
        5.4.2 สมาชิกสามัญ สภานิสิตจุฬาลงกรณ์มหาวิทยาลัย ประจำปีการศึกษา 2564
      </Text>,
    ],
  },
  {
    header: 'ข้อ 6 คุณสมบัติของผู้มีสิทธิออกเสียงเลือกตั้ง',
    contents: [
      'สำหรับการเลือกตั้งในตำแหน่งดังข้อ 4 ผู้มีสิทธิออกเสียงเลือกตั้งต้องกำลังศึกษาอยู่ในระดับชั้นปริญญาบัณฑิต ชั้นปีที่ 1 ถึงชั้นปีที่ 3 คณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย ในปีการศึกษา 2563 (รหัสประจำตัวนิสิต 613xxxxx21 หรือ 623xxxxx21 หรือ 633xxxxx21)',
    ],
  },
  {
    header: 'ข้อ 7 การสมัครเข้ารับเลือกตั้ง',
    contents: [
      '7.1 การสมัครเข้ารับเลือกตั้งในตำแหน่งดังข้อ 4 ให้นิสิตผู้ประสงค์ลงสมัครรับเลือกตั้งในตำแหน่งดังกล่าว ลงสมัครรับเลือกตั้งในแบบพรรค โดยจะต้องเสนอรายชื่อผู้ที่จะดำรงตำแหน่งดังต่อไปนี้ อย่างน้อย 2 ตำแหน่ง',
      <Text key="7.1.1" style={{ textIndent: '4rem' }}>
        7.1.1 รองหัวหน้านิสิต
      </Text>,
      <Text key="7.1.2" style={{ textIndent: '4rem' }}>
        7.1.2 รองหัวหน้านิสิตฝ่ายกิจการภายใน
      </Text>,
      <Text key="7.1.3" style={{ textIndent: '4rem' }}>
        7.1.3 รองหัวหน้านิสิตฝ่ายกิจการภายนอก
      </Text>,
      <Text key="7.1.4" style={{ textIndent: '4rem' }}>
        7.1.4 รองหัวหน้านิสิตฝ่ายวิรัชกิจ
      </Text>,
      <Text key="7.1.5" style={{ textIndent: '4rem' }}>
        7.1.5 รองหัวหน้านิสิตฝ่ายสนับสนุน
      </Text>,
      <Text key="7.1.6" style={{ textIndent: '4rem' }}>
        7.1.6 รองหัวหน้านิสิตฝ่ายพัฒนาองค์กร
      </Text>,
      'อนึ่ง การเสนอชื่อผู้ที่จะดำรงตำแหน่งตามข้อ 7.1.1 - 7.1.6 ผู้ที่ถูกเสนอชื่อจะต้องมีคุณสมบัติตามข้อ 1 เช่นเดียวกับนิสิตผู้ประสงค์ลงสมัครรับเลือกตั้ง',
      '7.2 ให้นิสิตผู้ประสงค์ลงสมัครรับเลือกตั้ง กระทำดังนี้',
      <Text key="7.2.1" style={{ textIndent: '4rem' }}>
        7.2.1 สำหรับการเลือกตั้งในตำแหน่งดังข้อ 4
        สามารถสมัครได้ทางออนไลน์ผ่านลิงก์ใน Facebook
        กรรมการนิสิตคณะวิศวกรรมศาสตร์ กวศ. ตั้งแต่วันพุธที่ 24 กุมภาพันธ์ พ.ศ.
        2564 เวลา 19.00 น. ถึง วันอาทิตย์ที่ 7 มีนาคม พ.ศ. 2564 เวลา 23.59 น.
      </Text>,
      <Text key="7.2.2" style={{ textIndent: '4rem' }}>
        7.2.2 ให้นิสิตผู้ประสงค์ลงสมัครรับเลือกตั้ง และผู้ที่ถูกเสนอชื่อตามข้อ
        7.1 รายงานตัวต่อคณะกรรมการหรือคณะอนุกรรมการที่คณะกรรมการมอบหมาย
        เพื่อรับทราบข้อมูลที่เกี่ยวข้องเกี่ยวกับ การเลือกตั้ง
        และแนวปฏิบัติในการประชาสัมพันธ์การเลือกตั้ง
        หลังการปิดรับสมัครรับเลือกตั้ง โดยวันเวลาและสถานที่จะแจ้งให้ทราบภายหลัง
      </Text>,
      <Text key="7.2.2 remark" style={{ textIndent: '4rem' }}>
        ทั้งนี้ หากนิสิตผู้ประสงค์ลงสมัครรับเลือกตั้ง
        และ/หรือที่ถูกเสนอชื่อตามข้อ 2.1 ไม่สามารถ มารายงานตัวได้ตามวันเวลา
        และสถานที่ที่แจ้งให้ทราบ
        ให้นิสิตผู้ประสงค์ลงสมัครรับเลือกตั้งและ/หรือที่ถูกเสนอชื่อแจ้งต่อคณะกรรมการหรือคณะอนุกรรมการที่คณะกรรมการมอบหมาย
        ภายในวันจันทร์ที่ 8 มีนาคม พ.ศ. 2564 เวลา 23.59 น.
      </Text>,
    ],
  },
  {
    header: 'ข้อ 8 การตรวจคุณสมบัติของผู้สมัครรับเลือกตั้ง',
    contents: [
      '8.1	ให้คณะกรรมการหรือคณะอนุกรรมการที่คณะกรรมการมอบหมาย ทําหน้าที่ตรวจสอบคุณสมบัติของผู้สมัครรับเลือกตั้งตามที่ระบุไว้ในข้อ 5 ให้เสร็จสิ้นภายใน 7 วัน นับตั้งแต่สิ้นสุดการรับสมัครเข้ารับเลือกตั้ง',
      'ทั้งนี้หากผู้สมัครรับเลือกตั้งคนใด ขาดคุณสมบัติตามข้อ 5 ให้คณะกรรมการเพิกถอนสิทธิการสมัครรับเลือกตั้งของผู้สมัครรับเลือกตั้งคนนั้น',
      '8.2	ให้คณะกรรมการหรือคณะอนุกรรมการที่คณะกรรมการมอบหมาย ทําหน้าที่พิจารณานโยบายของผู้สมัครรับเลือกตั้ง โดยเป็นไปตามดุลยพินิจของคณะกรรมการ',
    ],
  },
  {
    header: 'ข้อ 9 การประชาสัมพันธ์การเลือกตั้ง',
    contents: [
      'ให้รูปแบบสื่อการประชาสัมพันธ์การเลือกตั้งของผู้สมัครรับเลือกตั้งเป็นไปตามระเบียบที่คณะกรรมการกำหนด',
    ],
  },
  {
    header: 'ข้อ 10 วิธีการดําเนินการเลือกตั้ง',
    contents: [
      'ให้คณะกรรมการหรือคณะอนุกรรมการที่คณะกรรมการมอบหมาย จัดเตรียมช่องทางเลือกตั้งแบบออนไลน์ตามข้อ 3 และแต่งตั้งนิสิตเป็นเจ้าหน้าที่ดูแลช่องทางเลือกตั้งดังกล่าวในการควบคุมดูแลการออกเสียงเลือกตั้งและการนับคะแนนให้เป็นไปอย่างยุติธรรมและเรียบร้อยดังนี้',
      '10.1	การออกเสียงเลือกตั้ง ให้ใช้วิธีลงคะแนนเสียงผ่านระบบเลือกตั้งออนไลน์ที่ กวศ. เป็นผู้จัดทำขึ้น โดยข้อปฏิบัติสําหรับการออกเสียงเลือกตั้งมีดังนี้',
      <Text key="10.1.1" style={{ textIndent: '4rem' }}>
        10.1.1
        นิสิตผู้มีสิทธิออกเสียงเลือกตั้งเข้าสู่ระบบเลือกตั้งออนไลน์ด้วยรหัสนิสิตและรหัสผ่านระบบ
        CUNET โดยต้องยอมรับนโยบายการจัดเก็บข้อมูลที่ประกาศไว้ในช่องทางดังกล่าว
      </Text>,
      <Text key="10.1.2" style={{ textIndent: '4rem' }}>
        10.1.2 ตรวจสอบข้อมูลของตน ได้แก่ ชื่อ-นามสกุล รหัสนิสิต และชั้นปี
      </Text>,
      <Text key="10.1.3" style={{ textIndent: '4rem' }}>
        10.1.3
        ให้นิสิตผู้มีสิทธิออกเสียงเลือกตั้งทําเครื่องหมายแสดงการออกเสียงเลือกตั้งลงในช่องสี่เหลี่ยมที่ต้องการลงคะแนน
      </Text>,
      <Text key="10.1.4" style={{ textIndent: '4rem' }}>
        10.1.4 เมื่อระบบการเลือกตั้งแสดงว่าบันทึกการลงคะแนนสำเร็จ
        แสดงว่าการเลือกตั้งเป็นที่สิ้นสุด
      </Text>,
      '10.2	การทําเครื่องหมายแสดงการออกเสียงเลือกตั้งตามข้อ 10.1.3 ให้เป็นไปตามระเบียบที่คณะกรรมการกำหนด โดยให้ทําเครื่องหมายกากบาท (X) ลงในช่องหมายเลขประจําตัวผู้สมัครรับเลือกตั้งที่ต้องการลงคะแนนให้ หรือช่องไม่รับรอง หรือช่องงดออกเสียง ช่องใดช่องหนึ่งเพียงช่องเดียว',
    ],
  },
  {
    header: 'ข้อ 11 วิธีการนับคะแนน',
    contents: ['รวมรวมผลคะแนนในฐานข้อมูลของระบบเลือกตั้งออนไลน์ของ กวศ.'],
  },
  {
    header: 'ข้อ 12 การรับรองผลการเลือกตั้ง',
    contents: [
      '12.1	เมื่อคณะกรรมการได้รวบรวมผลการเลือกตั้งอย่างไม่เป็นทางการตามข้อ 11 แล้ว ให้คณะกรรมการแจ้งผลการเลือกตั้งอย่างไม่เป็นทางการแก่ผู้สมัครรับเลือกตั้งและกรรมการนิสิตคณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย และให้คณะกรรมการประกาศผลการเลือกตั้งอย่างไม่เป็นทางการแก่สาธารณชนทราบภายใน 24 ชั่วโมง นับตั้งแต่การนับคะแนนและการรวมคะแนนสิ้นสุดลง',
      '12.2	ให้คณะกรรมการรับรองผลการเลือกตั้งอย่างเป็นทางการ และส่งรายชื่อผู้รับการเลือกตั้งในตำแหน่งตามข้อ 4 แก่กรรมการนิสิตคณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย ภายใน 7 วัน นับตั้งแต่พ้นกำหนดการส่งคำประท้วงคัดค้านการเลือกตั้ง หรือคณะกรรมการพิจารณาการคัดค้านการเลือกตั้ง ตามข้อ 13 แล้วเสร็จ แล้วแต่กรณี',
    ],
  },
  {
    header: 'ข้อ 13 การคัดค้านการเลือกตั้ง',
    contents: [
      'ให้ผู้ประสงค์จะคัดค้านการเลือกตั้ง ยื่นคำประท้วงอย่างเป็นลายลักษณ์อักษรต่อคณะกรรมการผ่านทาง E-mail escchula63@gmail.com พร้อมแนบหลักฐานประกอบคำคัดค้าน และแจ้งประธานคณะกรรมการ นายธรธเนศ อู่ไทย ทางโทรศัพท์หมายเลข 084-024-1992 ภายในวันเสาร์ที่ 10 เมษายน พ.ศ. 2564 เวลา 23.59 น.',
    ],
  },
  {
    header: 'ข้อ 14 การวินิจฉัยและชี้ขาดในประเด็นอันเกี่ยวข้องกับการเลือกตั้ง',
    contents: [
      'ในกรณีที่มีประเด็นอื่นใดอันเกี่ยวข้องหรือมีส่วนเกี่ยวข้องกับการเลือกตั้ง ให้เป็นอำนาจของคณะกรรมการในการวินิจฉัยหรือชี้ขาดในประเด็นดังกล่าว และถือว่าคำวินิจฉัยและคำตัดสินของคณะกรรมการเป็นที่สิ้นสุด',
    ],
  },
  {
    header: 'ข้อ 15 บทลงโทษ',
    contents: [
      '15.1	ผู้สมัครรับเลือกตั้งคนใดกระทำการทุจริตในการเลือกตั้ง หรือกระทำการอื่นใดอันเป็นการฝ่าฝืนประกาศฉบับนี้หรือประกาศฉบับอื่นที่คณะกรรมการออกประกาศ หรือไม่ปฏิบัติตามคำตักเตือนของคณะกรรมการ หรือคณะอนุกรรมการ หรือเจ้าหน้าที่ดูแลช่องทางเลือกตั้ง จะต้องได้รับโทษตามระเบียบจุฬาลงกรณ์มหาวิทยาลัย ว่าด้วยวินัยนิสิต พ.ศ. 2527 และระเบียบจุฬาลงกรณ์มหาวิทยาลัย ว่าด้วยวินัยนิสิต (ฉบับที่ 2) พ.ศ. 2547 และถูกเพิกถอนสิทธิการสมัครรับเลือกตั้ง',
      'ทั้งนี้ การพิจารณาเพิกถอนสิทธิการสมัครรับเลือกตั้งของผู้สมัครรับเลือกตั้ง ให้เป็นดุลยพินิจของคณะกรรมการ',
      '15.2	นิสิตผู้ใดกระทำการทุจริตในการเลือกตั้ง หรือกระทำการอื่นใดอันเป็นการฝ่าฝืนประกาศฉบับนี้หรือประกาศฉบับอื่นที่คณะกรรมการออกประกาศ หรือไม่ปฏิบัติตามคำตักเตือนของคณะกรรมการ หรือคณะอนุกรรมการ หรือเจ้าหน้าที่ดูแลช่องทางเลือกตั้ง จะต้องได้รับโทษตามระเบียบจุฬาลงกรณ์มหาวิทยาลัย ว่าด้วยวินัยนิสิต พ.ศ. 2527 และระเบียบจุฬาลงกรณ์มหาวิทยาลัย ว่าด้วยวินัยนิสิต (ฉบับที่ 2) พ.ศ. 2547',
      '15.3	บุคคลที่ไม่ใช่นิสิตจุฬาลงกรณ์มหาวิทยาลัยผู้ใดกระทำการทุจริตในการเลือกตั้ง หรือกระทำการอื่นใดฝ่าฝืนประกาศฉบับนี้หรือประกาศฉบับอื่นที่คณะกรรมการออกประกาศ หรือไม่ปฏิบัติตามคำตักเตือนของคณะกรรมการ หรือคณะอนุกรรมการ หรือเจ้าหน้าที่ดูแลช่องทางเลือกตั้ง จะถูกส่งตัวไปยังภารกิจกิจการนิสิต คณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย หรือศูนย์รักษาความปลอดภัยและจัดการจราจรแห่งจุฬาลงกรณ์มหาวิทยาลัย เพื่อดำเนินการต่อไป',
    ],
  },
  {
    header: 'ข้อ 16 บทเฉพาะกาล',
    contents: [
      'ในกรณีที่คณะกรรมการสิ้นสุดลงไม่ว่าด้วยเหตุใดและยังมีประเด็นอื่นใดอันเกี่ยวข้องหรือมีส่วนเกี่ยวข้องกับการเลือกตั้งเหลืออยู่ ให้อำนาจของคณะกรรมการในประกาศฉบับนี้และประกาศฉบับอื่นที่คณะกรรมการออกประกาศ เป็นอำนาจของกรรมการนิสิตคณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย',
    ],
  },
]
