import React from 'react'
import { Text } from '@chakra-ui/react'
export const escRules = [
  {
    contents: [
      'เพื่อให้การเลือกตั้ง กรรมการนิสิตคณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัยประจำปีการศึกษา 2565 เป็นไปได้ด้วยความเรียบร้อย',
      'คณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย จึงมีประกาศให้กําหนดระเบียบการเลือกตั้งกรรมการนิสิตคณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัยประจำปีการศึกษา 2565 ไว้ดังต่อไปนี้',
    ],
  },
  {
    header:
      'ข้อ 1. การเลือกตั้งกรรมการนิสิตคณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย ประจำปีการศึกษา 2565',
    contents: [
      'การเลือกตั้งกรรมการนิสิตคณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย ประจำปีการศึกษา 2565 มาจากการเลือกตั้งจากนิสิตทุกชั้นปี คณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย ปีการศึกษา 2564 และในประกาศฉบับนี้เรียกว่า “การเลือกตั้ง”',
    ],
  },
  {
    header: 'ข้อ 2 กำหนดวัน เวลา และสถานที่เลือกตั้ง',
    contents: [
      'ให้ดำเนินการเลือกตั้งในวันศุกร์ที่ 6 พฤษภาคม พ.ศ. 2565 ตั้งแต่เวลา 08.30 น. ถึง 17.30 น. โดยให้นิสิตผู้มีสิทธิออกเสียงเลือกตั้งลงคะแนนผ่านระบบ CUNEX',
    ],
  },
  {
    header: 'ข้อ 3 สถานที่นับคะแนน และรวมคะแนน',
    contents: [
      'การรวบรวมผลคะแนนจะทำในระบบออนไลน์ หลังหมดเวลาการเลือกตั้ง คือ ตั้งแต่เวลา 17.30 น. ของวันศุกร์ที่ 6 พฤษภาคม พ.ศ. 2565 เป็นต้นไป',
    ],
  },
  {
    header: 'ข้อ 4 ตำแหน่งที่กำหนดไว้สำหรับการเลือกตั้งทั่วไปตามข้อ 1',
    contents: [
      'การเลือกตั้งทั่วไปเป็นการเลือกตั้งกรรมการตำแหน่งต่าง ๆ ในกรรมการนิสิตคณะวิศวกรรมศาตร์ จุฬาลงกรณ์มหาวิทยาลัย ซึ่งได้แก่ตำแหน่งดังต่อไปนี้',
      '4.1 ประธานนิสิต',
      '4.2 ประธานฝ่ายพัฒนานิสิต',
      '4.3 ประธานฝ่ายพัฒนาสังคมและบำเพ็ญประโยชน์',
      '4.4 ประธานฝ่ายวิชาการ',
      '4.5 ประธานหัวหน้าชั้นปี 4',
      '4.6 ประธานหัวหน้าชั้นปี 3',
      '4.7 ประธานหัวหน้าชั้นปี 2',
    ],
  },
  {
    header: 'ข้อ 5 คุณสมบัติของผู้สมัครรับเลือกตั้ง',
    contents: [
      '5.1 ต้องไม่เป็นนิสิตสภาพวิทยาทัณฑ์',
      '5.2 ต้องไม่เป็นนิสิตที่เคยถูกลงโทษตัดคะแนนความประพฤติ',
      '5.3 ต้องมีเกรดเฉลี่ยสะสมไม่ต่ำกว่า 2.00',
      '5.4 ผู้สมัครรับเลือกตั้งในตำแหน่งในข้อ 4.1-4.4 ต้องศึกษาในระดับชั้นปริญญาบัณฑิต ในปีการศึกษา 2564 ตั้งแต่ปี 2 ขึ้นไป',
      '5.5 ผู้สมัครรับเลือกตั้งในตำแหน่ง ในข้อ 4.5 ต้องศึกษาในระดับชั้นปริญญาบัณฑิต ในปีการศึกษา 2564 รหัสนิสิต 623xxxxx21',
      '5.6 ผู้สมัครรับเลือกตั้งในตำแหน่ง ในข้อ 4.6 ต้องศึกษาในระดับชั้นปริญญาบัณฑิต ในปีการศึกษา 2564 รหัสนิสิต 633xxxxx21',
      '5.7 ผู้สมัครรับเลือกตั้งในตำแหน่ง ในข้อ 4.7 ต้องศึกษาในระดับชั้นปริญญาบัณฑิต ในปีการศึกษา 2564 รหัสนิสิต 643xxxxx21',
      '5.8 สำหรับผู้ที่เคยดำรงตำแหน่ง ไม่สามารถลงสมัครรับเลือกตั้งในตำแหน่งเดิมได้',
    ],
  },
  {
    header: 'ข้อ 6 คุณสมบัติของผู้มีสิทธิออกเสียงเลือกตั้ง',
    contents: [
      'สำหรับการเลือกตั้งในตำแหน่งข้อ 4 ผู้มีสิทธิออกเสียงเลือกตั้งต้องกำลังศึกษาอยู่ในระดับชั้นปริญญาบัณฑิต ทุกชั้นปี คณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย ในปีการศึกษา 2564',
    ],
  },
  {
    header: 'ข้อ 7 การสมัครเข้ารับเลือกตั้ง',
    contents: [
      '7.1 ให้การสมัครเข้ารับเลือกตั้งในตำแหน่งตามข้อ 4 เป็นไปตามเงื่อนไขดังนี้',
      <Text key="7.1.1" style={{ textIndent: '4rem' }}>
        7.1.1 การสมัครเข้ารับเลือกตั้งในตำแหน่งในข้อ 4
        นิสิตผู้ประสงค์ลงสมัครรับเลือกตั้งสามารถลงสมัครรับเลือกตั้งในแบบกลุ่มหรืออิสระได้
      </Text>,
      '7.2 ให้นิสิตผู้ประสงค์จะสมัครรับเลือกตั้ง กระทำดังนี้',
      <Text key="7.2.1" style={{ textIndent: '4rem' }}>
        7.2.1 สำหรับการเลือกตั้งในตำแหน่งข้อ 4 สมัครได้ทางออนไลน์ผ่าน Google
        Form ที่คณะวิศวกรรมศาสตร์จัดทำไว้ ตั้งแต่วันจันทร์ที่ 25 เมษายน พ.ศ.
        2565 เวลา 10.00 น. ถึงวันศุกร์ที่ 29 เมษายน พ.ศ. 2565 เวลา 23.59 น.
      </Text>,
      <Text key="7.2.2" style={{ textIndent: '4rem' }}>
        7.2.2 รายงานตัวต่อคณะกรรมการจัดการเลือกตั้ง
        เพื่อรับทราบข้อมูลที่เกี่ยวข้องกับการเลือกตั้ง
        และแนวปฏิบัติในการประชาสัมพันธ์การเลือกตั้ง วันจันทร์ที่ 2 พฤษภาคม พ.ศ.
        2565 เวลา 13.30 น.
      </Text>,
      'หากนิสิตผู้ประสงค์จะสมัครรับเลือกตั้งไม่สามารถปฏิบัติตามข้อ 7.2.2 ให้นิสิตผู้ประสงค์ลงสมัครรับเลือกตั้งแจ้งต่อคณะกรรมการจัดการเลือกตั้ง ภายในวันเสาร์ที่ 30 เมษายน พ.ศ. 2565 เวลา 23.59 น.',
    ],
  },
  {
    header: 'ข้อ 8 การตรวจคุณสมบัติของผู้สมัครรับเลือกตั้ง',
    contents: [
      '8.1 ให้คณะกรรมการจัดการเลือกตั้ง ทําหน้าที่ตรวจสอบคุณสมบัติของผู้สมัครรับเลือกตั้งตามที่ระบุไว้ในข้อ 5 ให้เสร็จสิ้นภายใน 7 วัน นับตั้งแต่สิ้นสุดการรับสมัครเข้ารับเลือกตั้ง',
      'หากผู้สมัครรับเลือกตั้งคนใด ขาดคุณสมบัติตามข้อ 5 ให้คณะกรรมการจัดการเลือกตั้งเพิกถอนสิทธิการสมัครรับเลือกตั้งของผู้สมัครรับเลือกตั้งคนนั้น',
      '8.2 ให้คณะกรรมการจัดการเลือกตั้ง ทําหน้าที่พิจารณานโยบายของผู้สมัครรับเลือกตั้ง โดยเป็นไปตามดุลยพินิจของคณะกรรมการ',
    ],
  },
  {
    header: 'ข้อ 9 การประชาสัมพันธ์การเลือกตั้ง',
    contents: [
      '9.1 ให้รูปแบบสื่อการประชาสัมพันธ์การเลือกตั้งของผู้สมัครรับเลือกตั้งเป็นไปตามระเบียบที่คณะกรรมการกำหนด',
      '9.2 ห้ามผู้สมัครรับเลือกตั้งประชาสัมพันธ์การเลือกตั้ง ใช้ข้อความที่ไม่เหมาะสม อาทิเช่น ข้อมูลเท็จ การโจมตี/กล่าวหา หรือกระทบกับบุคคลอื่นๆ',
    ],
  },
  {
    header: 'ข้อ 10 วิธีการดําเนินการเลือกตั้ง',
    contents: [
      'ให้คณะกรรมการจัดการเลือกตั้ง จัดเตรียมช่องทางเลือกตั้งออนไลน์ และดูแลช่องทางเลือกตั้งดังกล่าวในการควบคุมดูแลการออกเสียงเลือกตั้ง และการนับคะแนนให้เป็นไปอย่างยุติธรรมและเรียบร้อย ดังนี้',
      '10.1 การออกเสียงเลือกตั้ง ให้ใช้วิธีลงคะแนนเสียงผ่านระบบเลือกตั้งออนไลน์ โดยข้อปฏิบัติสําหรับการออกเสียงเลือกตั้งดังนี้',
      <Text key="10.1.1" style={{ textIndent: '4rem' }}>
        10.1.1
        นิสิตผู้มีสิทธิออกเสียงเลือกตั้งเข้าสู่ระบบเลือกตั้งออนไลน์ด้วยรหัสนิสิตและรหัสผ่านระบบ
        CUNEX และต้องยอมรับนโยบายการจัดเก็บข้อมูลที่ประกาศไว้ในช่องทางดังกล่าว
      </Text>,
      <Text key="10.1.2" style={{ textIndent: '4rem' }}>
        10.1.2 ตรวจสอบข้อมูลของตน ได้แก่ ชื่อ-นามสกุล รหัสนิสิต และชั้นปี
      </Text>,
      <Text key="10.1.3" style={{ textIndent: '4rem' }}>
        10.1.3
        ให้นิสิตผู้มีสิทธิออกเสียงเลือกตั้งทําเครื่องหมายแสดงการออกเสียงเลือกตั้งลงในช่องสี่เหลี่ยมที่ต้องการลงคะแนน
      </Text>,
      <Text key="10.1.4" style={{ textIndent: '4rem' }}>
        10.1.4 เมื่อระบบการเลือกตั้งแสดงว่าบันทึกการลงคะแนนสำเร็จ
        แสดงว่าการเลือกตั้งเป็นที่สิ้นสุด
      </Text>,
      '10.2 การทําเครื่องหมายแสดงการออกเสียงเลือกตั้งตามข้อ 10.1.3 ให้เป็นไปตามระเบียบที่คณะกรรมการกำหนด โดยให้ทําเครื่องหมายกากบาท ลงในช่องหมายเลขประจําตัวผู้สมัครรับเลือกตั้งที่ต้องการลงคะแนนให้ ช่องไม่รับรอง หรือช่องงดออกเสียง ช่องใดช่องหนึ่งเพียงช่องเดียว',
    ],
  },
  {
    header: 'ข้อ 11 วิธีการนับคะแนน',
    contents: ['รวบรวมผลคะแนนจากฐานข้อมูลของระบบเลือกตั้ง'],
  },
  {
    header: 'ข้อ 12 การรับรองผลการเลือกตั้ง',
    contents: [
      '12.1 คณะกรรมการจัดการเลือกตั้งรวบรวมผลการเลือกตั้ง และสามารถประกาศผลการเลือกตั้งอย่างไม่เป็นทางการให้กับผู้สมัครรับทราบ  และส่งผลการเลือกตั้งแก่คณะกรรมการอำนวยการเลือกตั้ง ภายใน 24 ชั่วโมงนับตั้งแต่หมดเวลาการเลือกตั้ง',
      '12.2 ให้คณะกรรมการอำนวยการเลือกตั้งรับรองผลการเลือกตั้งอย่างเป็น ภายใน 7 วันนับตั้งแต่พ้นกำหนดการส่งคำประท้วงคัดค้านการเลือกตั้ง หรือคณะกรรมการอำนวยการพิจารณาการคัดค้านการเลือกตั้ง ตามข้อ 14 แล้วเสร็จ แล้วแต่กรณี',
    ],
  },
  {
    header: 'ข้อ 13 การคัดค้านการเลือกตั้ง',
    contents: [
      'ให้ผู้ประสงค์ที่จะคัดค้านการเลือกตั้ง ยื่นคำประท้วงเป็นลายลักษณ์อักษรต่อคณะกรรมการจัดการเลือกตั้งส่งมาที่ E-mail student.engchula@gmail.com พร้อมทั้งหลักฐานประกอบคำคัดค้าน',
    ],
  },
  {
    header: 'ข้อ 14 การวินิจฉัยและชี้ขาดในประเด็นอันเกี่ยวข้องกับการเลือกตั้ง',
    contents: [
      'ในกรณีที่มีประเด็นใด ๆ อันเกี่ยวข้องหรือมีส่วนเกี่ยวข้องกับการเลือกตั้ง ให้เป็นอำนาจของคณะกรรมการอำนวยการเลือกตั้งในการวินิจฉัยหรือชี้ขาดในประเด็นดังกล่าว และถือว่าคำวินิจฉัยและคำตัดสินของคณะกรรมการอำนวยการเป็นที่สิ้นสุด',
    ],
  },
  {
    header: 'ข้อ 15 บทลงโทษ',
    contents: [
      '15.1 ผู้สมัครรับเลือกตั้งคนใด กระทำการทุจริตในการเลือกตั้ง หรือกระทำการใดๆ อันเป็นการฝ่าฝืนประกาศฉบับนี้หรือประกาศฉบับอื่นที่คณะกรรมการจัดการเลือกตั้งออกประกาศ หรือไม่ปฏิบัติตามคำตักเตือนของคณะกรรมการจัดการเลือกตั้ง จะต้องได้รับโทษตามระเบียบจุฬาลงกรณ์มหาวิทยาลัย ว่าด้วยวินัยนิสิต พ.ศ. 2527 และระเบียบจุฬาลงกรณ์มหาวิทยาลัย ว่าด้วยวินัยนิสิต (ฉบับที่ 2) พ.ศ. 2547 และถูกเพิกถอนสิทธิการสมัครรับเลือกตั้ง การพิจารณาเพิกถอนสิทธิการสมัครรับเลือกตั้งของผู้สมัครรับเลือกตั้ง ให้เป็นดุลยพินิจของคณะกรรมการจัดการเลือกตั้ง',
      '15.2 นิสิตผู้ใดกระทำการทุจริตในการเลือกตั้งหรือกระทำการใดๆ อันเป็นการฝ่าฝืนประกาศฉบับนี้หรือประกาศฉบับอื่นที่คณะกรรมการจัดการเลือกตั้งออกประกาศ หรือไม่ปฏิบัติตามคำตักเตือนของคณะกรรมการจัดการเลือกตั้ง จะต้องได้รับโทษตามระเบียบจุฬาลงกรณ์มหาวิทยาลัย ว่าด้วยวินัยนิสิต พ.ศ. 2527 และระเบียบจุฬาลงกรณ์มหาวิทยาลัย ว่าด้วยวินัยนิสิต (ฉบับที่ 2) พ.ศ. 2547 และถูกเพิกถอนสิทธิการสมัครรับเลือกตั้ง การพิจารณาเพิกถอนสิทธิการสมัครรับเลือกตั้งของผู้สมัครรับเลือกตั้ง ให้เป็นดุลยพินิจของคณะกรรมการจัดการเลือกตั้ง',
    ],
  },
  {
    header: 'ข้อ 16 บทเฉพาะกาล',
    contents: [
      'ในกรณีที่คณะกรรมการจัดการเลือกตั้งและคณะกรรมการอำนวยการเลือกตั้งสิ้นสุดลงไม่ว่าด้วยเหตุใดและยังมีประเด็นใด ๆ อันเกี่ยวข้องหรือมีส่วนเกี่ยวข้องกับการเลือกตั้งเหลืออยู่  ให้อำนาจการพิจารณาอยู่ที่รองคณบดีด้านกิจการนิสิต หรือที่คณบดีมอบหมาย',
    ],
  },
]
